{"id":11696,"date":"2024-08-15T08:24:08","date_gmt":"2024-08-14T22:24:08","guid":{"rendered":"https:\/\/dev.luxeconceptsalon.com.au\/?post_type=stylist&#038;p=11696"},"modified":"2024-09-10T10:34:09","modified_gmt":"2024-09-10T00:34:09","slug":"kaitlin","status":"publish","type":"stylist","link":"https:\/\/www.luxeconceptsalon.com.au\/stylist\/kaitlin\/","title":{"rendered":"Kaitlin"},"content":{"rendered":"<p>Kaitlin is one of our brightest and creative talents. Kaitlin has elevated her craft through sheer tenacity in learning &amp; being taught by some of the industries leaders in cutting &amp; colouring. Her colours are technically advanced and her cuts are fresh while her blow dries are “what women want” big, sexy and long lasting, which is gaining her a solid and loyal clientele within Luxe.<\/p>\n<p>“ Beautiful blondes &amp; balayage accompanying messy long bobs or long layered haircuts is what I love creating – think textured natural beachy hair with rich &amp; creamy colours. Maintaining the hair’s condition is one of my main priorities. To finish there is nothing I love more than a strong, sexy blow dry – making my clients step out of my chair feeling beautiful”<\/p>\n<p>Kaitlin is one not to sit still so she is constantly expanding her skills to keep abreast of trends and her passion is taking her clients expectations from good to great. Having worked as a head assistant with Reuben Salon owner over the last three years, Kaitlin has been constantly learning and watching, fine-tuning her styling techniques.<\/p>\n<p>I have worked with Kaitlin since she started with our team in 2018 at Right from the start, it was evident that she had talent in hairdressing. A quiet achiever she has submerged herself in the craft, she gives her clients the very best of her skills and her work speaks for itself – simply beautifully executed, with clients walking away from her chair beaming. It has been a pleasure to help educate and watch her develop into one of our salons brightest stars” – Reuben<\/p>\n<p><em><strong>Availability: Tuesday, Wednesday, Thursday, Friday &amp; Saturday.<\/strong><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Kaitlin is one not to sit still so she is constantly expanding her skills to keep abreast of trends and her passion is taking her clients expectations from good to great.<\/p>\n","protected":false},"featured_media":11412,"menu_order":65,"template":"","experience":[20],"class_list":["post-11696","stylist","type-stylist","status-publish","has-post-thumbnail","hentry","experience-advanced-stylist"],"acf":[],"_links":{"self":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/stylist\/11696","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/stylist"}],"about":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/types\/stylist"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/media\/11412"}],"wp:attachment":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/media?parent=11696"}],"wp:term":[{"taxonomy":"experience","embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/experience?post=11696"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}