{"id":5673,"date":"2018-02-12T10:29:52","date_gmt":"2018-02-11T23:29:52","guid":{"rendered":"https:\/\/www.luxeconceptsalon.com.au\/?p=5673"},"modified":"2024-09-10T11:23:59","modified_gmt":"2024-09-10T01:23:59","slug":"5-things-didnt-know-damaging-hair","status":"publish","type":"post","link":"https:\/\/www.luxeconceptsalon.com.au\/blog\/5-things-didnt-know-damaging-hair\/","title":{"rendered":"5 Things You Didn&#8217;t Know Were Damaging Your Hair"},"content":{"rendered":"<p>We all like switching up our hair colour, using styling tools and trying different products, but do we really know the damage we&#8217;re doing to our hair each time?<\/p>\n<p>Now, we&#8217;re not saying don&#8217;t do it because let&#8217;s be honest, none of us are ever going to give up our curlers and monthly colour appointments, but there are things you&#8217;re doing at home that are damaging your hair without you eve knowing it…<\/p>\n<p>Follow these few simple steps and you&#8217;re on the right path to boosting your locks health and strength. Don&#8217;t forget to check yourself on what you&#8217;re eating for your mane health too.<\/p>\n<p>LOVE, LUXE<\/p>\n<h2>Using Cheap Styling Tools<\/h2>\n<p>It&#8217;s true, cheap styling tools will send your hair into damage zone more than expensive ones do. You&#8217;ll find with a lot of the upper market tools they&#8217;ll have specific coatings on the plates to protect your mane and they regulate temperature a lot better. Maintaining a level temperature with styling tools is actually a lot more important than you&#8217;d think. You know when certain strands of hair don&#8217;t straighten as well as the last and you sometimes run it over them maybe 3 or 4 times to get it completely straight?  That&#8217;s all because of the varying temperature that comes with the cheaper tools. Investing a little more can have a huge long term benefit on your locks.<\/p>\n<h2>Brushing Wet Hair<\/h2>\n<p>Avoid, avoid, avoid! This is such a no go – unless you’ve got a Tangle Teezer or a brush that’s <b>specifically<\/b> for wet hair. Your hair is at its weakest post showering, the bonds are weaker and you do a lot more damage brushing it through just after you’ve jumped out of the shower than you would if you gave it a little time to dry. Give it 15 minutes before brushing your tresses ladies!<\/p>\n<h2>Washing Your Hair Too Much?<\/h2>\n<p>Yes, it’s true. If you’re washing your hair everyday, you’re drying it out and making it weaker. Using products like dry shampoo for a few days can extend the wash-life of your hair and will help your hair strengthen too if you use one that is moisturising. Using quality shampoos however will always treat your, they need to be Sulphate free, Paraban free, Sodium Chloride and CFCS.<\/p>\n<h2>Growing Without Regular Trimming<\/h2>\n<p>What’s more important, having long locks or healthy locks? If you’re not popping in for a trim every 4-6 weeks your hair could end up being long, but dead and distressed. If you’re growing it out, you don’t have to have a lot lopped off, it’s simply about keeping it healthy and removing any dead ends. It’ll help it look glossier, healthier and when it gets to be long, it’ll be luscious and full of life instead of drab and in need of a MAJOR remodel.<\/p>\n<h2>Too Much Stress And Not Enough ZZZ’s<\/h2>\n<p>We all know about the effects of stress on our bodies. With stress, normally comes a lack of sleep which renders hell on your mind, body AND hair. Getting enough hours of restful sleep each night is so important for endless health reasons, but if you wanted to add another reason for racking up some extra hours in bed, this is it.<\/p>\n<p>Even better? Changing up your cotton or polyester pillowcase for a silk pillowcase, will help reduce breakage to the hair caused during sleep, and ensure your costly hair products are not absorbed by your bedding.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We all like switching up our hair colour, using styling tools and trying different products, but do we really know the damage we&#8217;re doing to our hair each time? Now, we&#8217;re not saying don&#8217;t do it because let&#8217;s be honest, none of us are ever going to give up our curlers and monthly colour appointments, [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":5686,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7],"tags":[],"class_list":["post-5673","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog"],"acf":[],"_links":{"self":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts\/5673","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/comments?post=5673"}],"version-history":[{"count":2,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts\/5673\/revisions"}],"predecessor-version":[{"id":11933,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts\/5673\/revisions\/11933"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/media\/5686"}],"wp:attachment":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/media?parent=5673"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/categories?post=5673"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/tags?post=5673"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}