{"id":6019,"date":"2018-03-12T12:29:23","date_gmt":"2018-03-12T01:29:23","guid":{"rendered":"https:\/\/www.luxeconceptsalon.com.au\/?p=6019"},"modified":"2020-08-27T18:28:29","modified_gmt":"2020-08-27T08:28:29","slug":"everything-need-know-appointment-luxe","status":"publish","type":"post","link":"https:\/\/www.luxeconceptsalon.com.au\/blog\/everything-need-know-appointment-luxe\/","title":{"rendered":"Everything You Need To Know About Your Appointment at Luxe"},"content":{"rendered":"<p>If you are considering making an appointment with us at LUXE Concept Salon – we understand that you may have some questions for us.<\/p>\n<p>We are a colour-driven salon, and it is what we do, and pride ourselves on, everyday. We aim to please every client, produce the perfect colour and provide a high standard of salon experience every time.<\/p>\n<h5>What will my stylist address in a consultation?<\/h5>\n<p>Our stylists are trained to give full transparency to our clients during the consultation component of each appointment, and we ask the same of our clients! The stylists need to know a full and complete colour history of the hair in order to understand what we are dealing with, and give you the best standard of service possible.<\/p>\n<p>Your stylist will also recommend appropriate home care products, toning products, and rebooking recommendations which will best help us maintain your colour. We always aim to educate our clients in a kind, honest &amp; transparent way, so that we are able to come to a shared understanding with what is possible in regards to the science of hair.<\/p>\n<h5>Which stylist should I book my appointment with?<\/h5>\n<p>Our team have been trained by the best, and are all very capable of any services. Whilst you are a client of LUXE Concept Salon, there is more to a stylist than just their work, and we understand that sometimes, it is about the right fit! Once you find the right stylist, this relationship becomes a beautiful friendship. All of our team have their unique personalities – some bright &amp; bubbly, cheeky, quirky, shy, easy-going and sweet.<\/p>\n<h5>Do I need to confirm my appointment?<\/h5>\n<p>All of our bookings need to be confirmed the day prior to your service. As part of the LUXE Concept Salon experience, we send out a text message 48-hours prior to your appointment – and we ask that you simply respond with a Y (to indicate confirmation of attendance) or N (to indicate cancellation). Alternatively, you can call the salon on (02) 9412 1244 to confirm or reschedule your appointment. Any bookings that are left unconfirmed will be followed up by our Front Desk staff as a reminder to confirm your appointment. If we are unable to get a hold of you following several contact attempts, LUXE Concept Salon reserves the right to offer your appointment time to others on our wait list.<\/p>\n<h5>What is a booking fee, and why does LUXE Concept Salon require it?<\/h5>\n<p>At LUXE Concept Salon, we require a booking fee from $50.00-100.00 to secure longer appointments – such as those for colour work or colour correction services. As the length of some of these specialist appointments are so long, due to the nature of the work, we need to ensure clients are serious about our time. No-Show appointments are costly for the salon, and as our stylists work on commission, when clients do not show up, the stylists do not get paid.<\/p>\n<p>Any No-Show appointment will be asked to pay for any other services booked in full prior to their booking should they wish to return to the salon.<\/p>\n<h5>What is artificial colour build up, and how does it affect the desired colour I am trying to achieve?<\/h5>\n<p>Colour build-up refers to any type of colour that has been applied to your hair at any stage. Unless your hair is 100% grown out, you will most likely have old colour remaining on your hair – even if the last colour was applied some time ago.<\/p>\n<p>Colour build-up and the past colour history of your hair will affect the type of result that you would like to achieve now. In some instances, we have found that colour build-up can lead to overlapping, banding, patchiness and colour that is near impossible to remove.<\/p>\n<p>Many clients who have had past colour work done &amp; colour build-up ask us if they can achieve blonde or certain levels of lightness. Once you have colour build-up in your hair, it can take a long time to remove – especially dark tones. Usually, during the lightening process, you will see red, copper, orange, brass and then blonde. In some instances, it can take around a year to completely achieve your desired colour, and it all depends on how easily prior colour can be removed.<\/p>\n<h5>Do I need to come in to the salon for a consultation prior to my booking?<\/h5>\n<p>We strongly advise all clients to book in for a consultation prior to the actual colour appointment. This complimentary service (15-20 minutes) allows our stylists to assess your hair condition and any possible colour build-up, as well as approximate the time and services required, and give you a more precise and personalised quote.<\/p>\n<p>We do understand that many of our clients travel long distances to come visit us, and it is not always ideal to come for the shorter consultation appointment. We encourage our clients to email us images to our salon email or privately message our Facebook page.<\/p>\n<p>&nbsp;<\/p>\n<p>Have any more questions that haven&#8217;t been answered here? Visit our <a href=\"https:\/\/www.luxeconceptsalon.com.au\/faqs\/\">FAQ&#8217;s<\/a> page for more information and answers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you are considering making an appointment with us at LUXE Concept Salon – we understand that you may have some questions for us. We are a colour-driven salon, and it is what we do, and pride ourselves on, everyday. We aim to please every client, produce the perfect colour and provide a high standard [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":6020,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7],"tags":[],"class_list":["post-6019","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog"],"acf":[],"_links":{"self":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts\/6019","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/comments?post=6019"}],"version-history":[{"count":0,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts\/6019\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/media\/6020"}],"wp:attachment":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/media?parent=6019"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/categories?post=6019"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/tags?post=6019"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}