{"id":7723,"date":"2024-10-14T10:15:07","date_gmt":"2024-10-13T23:15:07","guid":{"rendered":"https:\/\/www.luxeconceptsalon.com.au\/?p=7723"},"modified":"2024-10-21T19:20:23","modified_gmt":"2024-10-21T08:20:23","slug":"christmas-etiquette-at-luxe","status":"publish","type":"post","link":"https:\/\/www.luxeconceptsalon.com.au\/blog\/christmas-etiquette-at-luxe\/","title":{"rendered":"Busy-Season Etiquette at Luxe"},"content":{"rendered":"<p>For all clients travelling to the salon over the next couple of months, we ask for everyone to allow extra time getting to us. The car park and traffic around the Chase can often get quite crazy, especially with the limited parking options in Chatswood Chase.<\/p>\n<p><!--more--><\/p>\n<p>If you don’t want to face the parking of Chatswood Chase, we are also suggesting for our clients to park across the road at the Concourse, Westfield Chatswood or street parking.<\/p>\n<p>As our stylists are all running on fully booked columns, unfortunately if one client runs late, it will impact the rest of their day. We encourage clients to arrive at the salon <strong>ten minutes prior<\/strong> to the appointment to enjoy refreshments with us and have the full Luxe experience.<\/p>\n<h3>Other things we ask clients to keep in mind:<\/h3>\n<p><strong>Phone ahead if you are running late.<\/strong><br \/>\nLetting the salon know if you are running late will give your stylist the chance to shift things around if need be. Unfortunately if your running more than 15 minutes late for your appointment, we will struggle to keep your booking. In cases when the client is running more than 15 minutes late, Luxe reserves the right to refuse or reduce your appointment.<\/p>\n<p><strong>Can’t make your appointment? Please be aware of our 24-hour cancellation policy<\/strong><br \/>\nWe kindly ask all clients to be respectful of our stylists, as we are of yours. If you are unable to make your appointment, please give us as much notice as possible. Luxe Concept Salon requires 24 hours cancellation for all appointments. If you cancel within 24 hours, you will be required to pay a 50% cancellation fee. If you fail to turn up for your appointment, we will not make a future appointment without the 50% cancellation fee. Should you wish to reduce or remove a service from your appointment, e.g. you don’t wish to have your Cut with your colour, we do require 24 hours notice for such changes to allow us adequate time to fill the slot. Luxe will send automatic confirmations 72-hours before your appointment – we kindly ask that you reply to this as soo as you can from receiving. Unconfirmed appointments will be called the day before the appointment and if we are unable to reach you, the appointment will be removed from our booking system.<\/p>\n<p><strong>Deposits for lengthy appointments<\/strong><br \/>\nWhen making an appointment for any relaxing service, colour correction or longer colour bookings, a $50.00 deposit will be required to secure the appointment. This deposit will be deducted from your bill on the day of appointment and should you wish to cancel or re-schedule, this deposit can be transferred or refunded as long as it is before the 24-hour window of your appointment.<\/p>\n<p><strong>Make sure you say what you like\/dislike<\/strong><br \/>\nDescribe what you like and don’t like about your current hair and what you want to achieve.<\/p>\n<p><strong>Let the stylist know if you want something changed as we will have limited availabilities to adjust what you may not like<\/strong><br \/>\nFringe not short enough? Want more layers? Don’t be afraid to let the stylist know on the day. We always want to make sure you are leaving 100% satisfied with your service.<\/p>\n<p><strong>Be realistic with your budget<br \/>\n<\/strong>Dramatic colour makeovers take many hours, excessive product and an acute understanding of hair lightening. We also ask you have no time restrictions as to achieve great results our stylists will need time and your commitment to make possible. No one likes to be rushed, especially when it can affect the colour outcome.<\/p>\n<p><strong>Invest in the correct care for your hair at home.<br \/>\n<\/strong>Your stylist will set you up with appropriate shampoo, conditioner, masque and bonder to ensure you can have healthy, shiny hair as long as you desire.<\/p>\n<p>Whilst Christmas is a crazy time in the salon, it is also our favourite time of the year and look forward to celebrating the festive season with our clients.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For all clients travelling to the salon over the next couple of months, we ask for everyone to allow extra time getting to us. The car park and traffic around the Chase can often get quite crazy, especially with the limited parking options in Chatswood Chase.<\/p>\n","protected":false},"author":4,"featured_media":12134,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7],"tags":[],"class_list":["post-7723","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog"],"acf":[],"_links":{"self":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts\/7723","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/comments?post=7723"}],"version-history":[{"count":10,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts\/7723\/revisions"}],"predecessor-version":[{"id":12153,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts\/7723\/revisions\/12153"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/media\/12134"}],"wp:attachment":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/media?parent=7723"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/categories?post=7723"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/tags?post=7723"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}