{"id":8097,"date":"2019-03-11T09:41:48","date_gmt":"2019-03-10T22:41:48","guid":{"rendered":"https:\/\/www.luxeconceptsalon.com.au\/?p=8097"},"modified":"2025-01-21T12:27:28","modified_gmt":"2025-01-21T01:27:28","slug":"silicone-based-hair-products-the-ugly-truth","status":"publish","type":"post","link":"https:\/\/www.luxeconceptsalon.com.au\/blog\/silicone-based-hair-products-the-ugly-truth\/","title":{"rendered":"Silicone-Based Hair Products &#8211; The Ugly Truth"},"content":{"rendered":"<p>You may have heard about your stylist talk about it when recommending home-care, or maybe you&#8217;ve noticed your tresses becoming limp, lifeless and dull? Chances are you&#8217;re hair isn&#8217;t becoming immune to hair products, what is probably happening is <strong>silicone build-up<\/strong>.<\/p>\n<p><!--more--><\/p>\n<h3 style=\"text-align: left;\">Let&#8217;s Start With The Basics<\/h3>\n<p>What is silicone you might ask? Without getting too sciency, used often in beauty and predominantly hair-care products, silicones are a large class of materials that coat the hair and assist in providing smoothness and shine..for a while.<\/p>\n<p>Whilst this sounds like something we are all wanting our hair products to do, it is in fact all an illusion. As silicone is almost like a rubber or plastic, it is essentially acting as a sealant against both water and air and prevents moisture from penetrating the hair shaft. In general, silicones are incredibly hydrophobic, meaning they essentially “waterproof” the hair and do not wash out easily. Ever had a blow-dry at a salon and noticed your hair become noticeably smokey? This is effectively the silicones heating up, and burning off the hair &#8211; EEK!<\/p>\n<p>We know this must sound pretty scary if it’s the first your hearing about silicones nasties, but let us talk you through on how they affect your hair and how to avoid them.<\/p>\n<h3 style=\"text-align: left;\">Advantages Of Silicones (Or so they say)<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-medium wp-image-8102 alignright\" src=\"https:\/\/www.luxeconceptsalon.com.au\/wp-content\/uploads\/2019\/03\/silicone-blog-1-235x300.jpg\" alt=\"\" width=\"235\" height=\"300\" srcset=\"https:\/\/www.luxeconceptsalon.com.au\/wp-content\/uploads\/2019\/03\/silicone-blog-1-235x300.jpg 235w, https:\/\/www.luxeconceptsalon.com.au\/wp-content\/uploads\/2019\/03\/silicone-blog-1.jpg 313w, https:\/\/www.luxeconceptsalon.com.au\/wp-content\/uploads\/2019\/03\/silicone-blog-1-200x256.jpg 200w\" sizes=\"(max-width: 235px) 100vw, 235px\" \/><\/p>\n<p>After reading what silicones actually are, you’re probably thinking “so why are they even used at all?”. WELL, silicones are mainly added to hair products because they are cheap for companies to use, so your Shampoo and Conditioner are cheaper to buy.<\/p>\n<p>Silicones also make the hair feel TEMPORARILY (we can’t stress this enough) great as well. Hair that is dry and damaged can be left feeling and looking healthy and gives the hair a slippery-when-wet-feel which is perfect for detangling those unmanageable tresses we can all get from time to time.<\/p>\n<p>But don’t be deceived&#8230;<\/p>\n<h3 style=\"text-align: left;\">What Silicone Really Does<\/h3>\n<p>Though these plasticy-polymers leave your mane looking shiny and sleek – this is an artificial shine caused by a layer of plastic that builds up on the hair. Over time, silicones will also begin to weigh down your hair, making it dull and lifeless, and  impossible to style – something none of us want!<\/p>\n<p>To make things simple, silicone basically suffocates the hair and prevents any nutrients from penetrating the hair shaft. With time, our much-loved tresses will become dry and brittle, due to the lack of moisture which can lead to breakage, frizz and brittleness. If you are using leave-in oils, hair masks or other treatment-based products, chances are they aren’t really going to be working if you are using them alongside a silicone-based shampoo or conditioner.<\/p>\n<p>Another downside of silly-cones (see what we’ve done here ), is that they can’t be washed out of the hair easily as they are not water soluble. Over time, the plasticy, rubbery molecules build up on the hair which is what we call “silicone build up”.<\/p>\n<h3 style=\"text-align: left;\">Still think your supermarket shampoo will cut it?<\/h3>\n<p>So you want to lighten your hair? Maybe you’d like some Balayage or even just a colour gloss to add some shine and<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-medium wp-image-8104 alignright\" src=\"https:\/\/www.luxeconceptsalon.com.au\/wp-content\/uploads\/2019\/03\/silicone-blog-2-300x168.jpg\" alt=\"\" width=\"300\" height=\"168\" srcset=\"https:\/\/www.luxeconceptsalon.com.au\/wp-content\/uploads\/2019\/03\/silicone-blog-2-300x168.jpg 300w, https:\/\/www.luxeconceptsalon.com.au\/wp-content\/uploads\/2019\/03\/silicone-blog-2-200x112.jpg 200w, https:\/\/www.luxeconceptsalon.com.au\/wp-content\/uploads\/2019\/03\/silicone-blog-2-400x225.jpg 400w, https:\/\/www.luxeconceptsalon.com.au\/wp-content\/uploads\/2019\/03\/silicone-blog-2-600x337.jpg 600w, https:\/\/www.luxeconceptsalon.com.au\/wp-content\/uploads\/2019\/03\/silicone-blog-2-500x281.jpg 500w, https:\/\/www.luxeconceptsalon.com.au\/wp-content\/uploads\/2019\/03\/silicone-blog-2.jpg 650w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/p>\n<p>depth to your hair? Chances are if you have been using supermarket products (cough cough Pantene &amp; TreSemme) over a long period time, your hairdresser will be unable to achieve that Instagram-worthy hair.<\/p>\n<p>As silicone coats the hair and creates a barrier, this not only makes it harder for the colour or bleach to penetrate the hair due to the build-up, but can also cause a chemical reaction that can cause some serious damage.<\/p>\n<p>Basically, the colour has to eat through an extra layer before even reaching the hair, which will likely lead to your colour fading a lot quicker and not achieving great results. If you are investing in a colouring service, it is so important to then invest in some quality home care, like Davines (their whole range is silicone-free).<\/p>\n<h3 style=\"text-align: left;\">Looking to up your hair game?<\/h3>\n<p>We get it – we have all seen those bright lit, wind swept commercials of lavish, luscious hair that can be achieved with supermarkets products, but now you’ve got some home truths, let us talk you though our silicone-free favourites you should be stocking up on.<\/p>\n<p style=\"text-align: center;\">Oribe The Cleanse Clarifying Shampoo<\/p>\n<p>Using skincare quality exfoliants, The Cleanse Clarifying Shampoo purifies the hair and scalp without stripping the natural essence. Volcanic ash powers this detoxifying mousse, which polishes away dirt, oil, and product buildup. Hair is restored, with a new inner glow.<\/p>\n<p style=\"text-align: center;\">R + Co Acid Wash Cleansing Rinse<\/p>\n<p>Sometimes you need to strip things down and get back to your natural state. After days of dry shampoo layers and styling products, and silicone-based products, ACID WASH is perfect to cleanse without stripping away natural oils or colour. It softens the hair, calms the scalp adds dramatic shine – the perfect solution to use before any colour transformation.<\/p>\n<p style=\"text-align: center;\">Davines Oi Range<\/p>\n<p>Davines best-selling and award-winning range Oi, acts as both a daily routine and styling agent. Formulated with Roucou oil, the products give extraordinary shine (real kind of shine too) and softness, while detangling any kind of hair. Filled with antioxidants, this range promises to nourish and smooth the hair without leaving residue on the hair.<\/p>\n<p style=\"text-align: center;\">Kerastase Masque Magistral<\/p>\n<p>Once you&#8217;ve made the shift from silicone based products to professional home-care, you&#8217;ll want to add some intense moisture and nourishment to your mane. Kerastase Masque Magistral deeply nourishes the hair, leaving it soft to touch, highly manageable and assists in detangling.<\/p>\n<p>Next time your stylist starts speaking about silicones, or this information is all new to you, you know exactly what is going down now. Still unsure of what silicone-free products to make the switch to? <a href=\"https:\/\/www.luxeconceptsalon.com.au\/contact-us\/\">Contact us<\/a> for a complimentary phone or email consultation, or even visit the salon.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You may have heard about your stylist talk about it when recommending home-care, or maybe you&#8217;ve noticed your tresses becoming limp, lifeless and dull? Chances are you&#8217;re hair isn&#8217;t becoming immune to hair products, what is probably happening is silicone build-up.<\/p>\n","protected":false},"author":4,"featured_media":8102,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[7],"tags":[33],"class_list":["post-8097","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog","tag-update"],"acf":[],"_links":{"self":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts\/8097","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/comments?post=8097"}],"version-history":[{"count":3,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts\/8097\/revisions"}],"predecessor-version":[{"id":12495,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/posts\/8097\/revisions\/12495"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/media\/8102"}],"wp:attachment":[{"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/media?parent=8097"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/categories?post=8097"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.luxeconceptsalon.com.au\/wp-json\/wp\/v2\/tags?post=8097"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}